# BoundaryRestraintX Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryRestraintX Property
ParameterTypeId Class See Also
---
"X Spring Modulus"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryRestraintX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryRestraintX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryRestraintX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace